# file location: ${HOME}/Brewfile

# This file is used along with the `brew bundle` command to ensure that required packages and apps are installed.
# Also can be used to ensure that any package/apps that were installed as experimentation are uninstalled from the system.
# For a more detailed explanation of the philosophy/reasoning behind this file, please see https://openfolder.sh/macos-migrations-with-brewfile

# These are the common shell aliases that I have setup in the `${HOME}/.aliases` file for ease of running/typing (and also don't need to remember all these commands by-heart!). If you are using my `${HOME}/.aliases`, they will already be present for you. If not, you can then set these up in the respective dotfile of your choice
# alias bcg='brew outdated --greedy'  # List all casks that are outdated like a "dry-run" (and which have version marked as 'latest')
# alias bcug='brew upgrade --greedy'  # Upgrades all casks that are outdated (and which have version marked as 'latest')
# alias bupc='brew bundle check || brew bundle --all --cleanup; brew bundle cleanup -f; brew cleanup --prune=all; brew autoremove; brew upgrade'        # Upgrades and cleans up all regular outdated casks and libs (non-greedy)

# TODO: Need to find cask for:
#   Tinkertool
#   ZoomHider

# set global preferences for all 'brew install' commands
cask_args appdir: '/Applications', no_quarantine: true

# java_present = system('/usr/libexec/java_home --failfast')
is_arm = Hardware::CPU.arm?

tap 'homebrew/services'
tap 'romkatv/powerlevel10k'
tap 'azure/functions'


# brew 'moreutils'
# brew 'shellcheck'
# brew 'syncthing'
brew 'autoconf'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'btop'
# brew 'cask'
brew 'curl'
brew 'diff-so-fancy'
brew 'direnv'
brew 'emacs'
brew 'eza'
brew 'freetds'
brew 'gimme-aws-creds'
brew 'git-extras'
brew 'git-gui'
brew 'git-tools'
brew 'git'
# brew 'glib'
brew 'gnupg'
brew 'gnutls'
brew 'guile'
brew 'http-server'
brew 'jpeg-xl'
brew 'jq'
brew 'kcat'
brew 'less'
brew 'lftp'
brew 'libfido2'
brew 'libidn2'
brew 'libpq'
brew 'libssh'
brew 'maven'
brew 'mise'
# brew 'mysql'
brew 'ncdu'
brew 'nghttp2'
brew 'openldap'
brew 'p11-kit'
# brew 'poetry'
brew 'postgresql@14'
brew 'powerlevel10k'
brew 'prettyping'
brew 'qemu'
brew 'ripgrep'
brew 'saml2aws'
brew 'talisman'
brew 'terraform'
brew 'tldr'
brew 'unbound'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'wifi-password'
brew 'yazi'
brew 'zsh'

# ----------------------------------------------------------------------------------------------------------
# cask 'cloudflare-warp'
# cask 'keepassxc@beta'
# cask 'keepingyouawake'
# cask 'libreoffice'
# cask 'ollama', restart_service: :changed
# cask 'silicon' if is_arm
# cask 'vscodium@insiders'   # TODO: Doesn't handle 'Remote Containers' and GH-based auto-syncing when comparing to VSCode
cask '1password-cli'
cask '1password'
cask 'aldente'
# cask 'alt-tab'
cask 'appcleaner'
cask 'arc'
cask 'aws-vpn-client'
# cask 'balance-lock'
cask 'brave-browser'
cask 'clocker'
# cask 'firefox@nightly' #, greedy: true
cask 'font-meslo-lg-nerd-font'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'insomnia'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'itsycal'
cask 'keybase'
cask 'laravel-kit'
cask 'logi-options+'
cask 'microsoft-auto-update'
cask 'microsoft-office'
cask 'microsoft-remote-desktop'
cask 'microsoft-teams'
cask 'monolingual'
# cask 'notunes'
# cask 'ollama', restart_service: :changed
cask 'orbstack'
cask 'protonvpn'
cask 'ngrok'
# cask 'notunes'
cask 'pgadmin4'
cask 'postman'
cask 'protonvpn'
# cask 'pycharm-ce'
# cask 'rancher'
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'stats'
# cask 'tableplus'
cask 'the-unarchiver'
cask 'todoist'
cask 'visual-studio-code'
# cask 'warp'
cask 'xampp-vm'
cask 'zoom'

vscode 'alefragnani.project-manager'
vscode 'codezombiech.gitignore'
vscode 'donjayamanne.git-extension-pack'
vscode 'donjayamanne.githistory'
vscode 'eamodio.gitlens'
vscode 'esbenp.prettier-vscode'
vscode 'hashicorp.terraform'
vscode 'hbenl.vscode-test-explorer'
vscode 'kevinrose.vsc-python-indent'
vscode 'kreativ-software.csharpextensions'
vscode 'meezilla.json'
vscode 'ms-azuretools.vscode-docker'
vscode 'ms-dotnettools.csdevkit'
vscode 'ms-dotnettools.csharp'
vscode 'ms-dotnettools.vscode-dotnet-runtime'
vscode 'ms-ossdata.vscode-postgresql'
vscode 'ms-python.debugpy'
vscode 'ms-python.python'
vscode 'ms-python.vscode-pylance'
vscode 'ms-vscode.makefile-tools'
vscode 'ms-vscode.test-adapter-converter'
vscode 'postman.postman-for-vscode'
vscode 'qwtel.sqlite-viewer'
vscode 'rangav.vscode-thunder-client'
vscode 'redhat.vscode-xml'
vscode 'vscode-icons-team.vscode-icons'
vscode 'vscodevim.vim'
vscode 'tyriar.sort-lines'
vscode 'yuvraj.json-scape-unscape'
vscode 'zainchen.json'
vscode 'ziyasal.vscode-open-in-github'
