# file location: ${HOME}/Brewfile

# This file is used along with the `brew bundle` command to ensure that required packages and apps are installed.
# Also can be used to ensure that any package/apps that were installed as experimentation are uninstalled from the system.
# For a more detailed explanation of the philosophy/reasoning behind this file, please see https://openfolder.sh/macos-migrations-with-brewfile

# These are the common shell aliases that I have setup in the `${HOME}/.aliases` file for ease of running/typing (and also don't need to remember all these commands by-heart!). If you are using my `${HOME}/.aliases`, they will already be present for you. If not, you can then set these up in the respective dotfile of your choice
# alias bcg='brew outdated --greedy'  # List all casks that are outdated like a "dry-run" (and which have version marked as 'latest')
# alias bcug='brew upgrade --greedy'  # Upgrades all casks that are outdated (and which have version marked as 'latest')
# alias bupc='brew bundle check || brew bundle --all --cleanup; brew cleanup --prune=all; brew autoremove; brew upgrade'        # Upgrades and cleans up all regular outdated casks and libs (non-greedy)

# TODO: Need to find cask for:
#   Tinkertool
#   ZoomHider

# set global preferences for all 'brew install' commands
cask_args appdir: '/Applications', fontdir: '/Library/Fonts', no_quarantine: true, adopt: true

# java_present = system('/usr/libexec/java_home --failfast')
is_arm = Hardware::CPU.arm?

tap 'homebrew/services'
tap 'romkatv/powerlevel10k'
tap 'azure/functions'

# brew 'btop'
# brew 'cask'
# brew 'glib'
# brew 'less'
# brew 'moreutils'
# brew 'mysql'
# brew 'ncdu'
# brew 'nghttp2'
# brew 'p11-kit'
# brew 'poetry'
# brew 'prettyping'
# brew 'qemu'
# brew 'shellcheck'
# brew 'syncthing'
# brew 'tldr'
# brew 'unbound'
# brew 'watch'
brew 'autoconf'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'curl'
brew 'diff-so-fancy'
brew 'direnv'
brew 'emacs'
brew 'eza'
brew 'fzf'
brew 'gh'
brew 'gimme-aws-creds'
brew 'git-extras'
brew 'git-gui'
brew 'git-tools'
brew 'git'
brew 'gnupg'
brew 'gnutls'
brew 'guile'
brew 'http-server'
brew 'jpeg-xl'
brew 'jq'
brew 'kcat'
brew 'lftp'
brew 'libfido2'
brew 'libidn2'
brew 'libpq'
brew 'libssh'
brew 'maven'
brew 'mise'
brew 'openldap'
brew 'postgresql@14'
brew 'powerlevel10k'
brew 'ripgrep'
brew 'saml2aws'
brew 'talisman'
brew 'terraform'
brew 'vim'
brew 'wget'
brew 'wifi-password'
brew 'yazi'
brew 'zsh'


# ----------------------------------------------------------------------------------------------------------
# cask 'alt-tab'
# cask 'balance-lock'
# cask 'cloudflare-warp'
# cask 'firefox@nightly' #, greedy: true
# cask 'intellij-idea-ce'
# cask 'itsycal'
# cask 'keepassxc@beta'
# cask 'keepingyouawake'
# cask 'libreoffice'
# cask 'logi-options+'
# cask 'notunes'
# cask 'ollama', restart_service: :changed
# cask 'orbstack'
# cask 'pgadmin4'
# cask 'protonvpn'
# cask 'pycharm-ce'
# cask 'rancher'
# cask 'silicon' if is_arm
# cask 'tableplus'
# cask 'vscodium@insiders'   # TODO: Doesn't handle 'Remote Containers' and GH-based auto-syncing when comparing to VSCode
# cask 'warp'
cask '1password-cli'
cask '1password'
cask 'aldente'
cask 'appcleaner'
cask 'arc'
cask 'aws-vpn-client'
cask 'brave-browser'
cask 'clocker'
cask 'font-meslo-lg-nerd-font'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'insomnia'
cask 'iterm2'
cask 'jordanbaird-ice'
cask 'keybase'
cask 'keycastr'
cask 'laravel-kit'
cask 'microsoft-auto-update'
cask 'microsoft-office'
cask 'microsoft-remote-desktop'
cask 'microsoft-teams'
cask 'monolingual'
cask 'ngrok'
cask 'nikitabobko/tap/aerospace'
cask 'notunes'
cask 'postman'
cask 'rancher'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'stats'
cask 'the-unarchiver'
cask 'todoist'
cask 'virtualbox'
cask 'visual-studio-code'
# cask 'vscodium@insiders'   # TODO: Doesn't handle 'Remote Containers' and GH-based auto-syncing when comparing to VSCode
cask 'whatsapp'
cask 'xampp-vm'
cask 'zen-browser@twilight'
cask 'zoom'

# VSCode extensions
# Note: I don't want brew to silently install VS Code (which is what it does currently if the following lines are present but it doesn't find code!)
is_vscode_installed = !`which code`.chomp.empty?
if is_vscode_installed
  # This is failing on different machines
  # vscode 'formulahendry.code-runner'
  # vscode 'nicolasvuillamy.vscode-groovy-lint'
  # vscode 'redhat.java'
  # vscode 'sonarsource.sonarlint-vscode'
  # vscode 'vscjava.vscode-java-debug'
  # vscode 'vscjava.vscode-java-pack'
  # vscode 'vscjava.vscode-java-test'
  # vscode 'vscjava.vscode-lombok'
  vscode 'alefragnani.project-manager'
  vscode 'brandonkirbyson.vscode-animations'
  vscode 'britesnow.vscode-toggle-quotes'
  vscode 'codezombiech.gitignore'
  vscode 'davidanson.vscode-markdownlint'
  vscode 'dbaeumer.vscode-eslint'
  vscode 'digitalbrainstem.javascript-ejs-support'
  vscode 'donjayamanne.git-extension-pack'
  vscode 'donjayamanne.githistory'
  vscode 'drcika.apc-extension'
  vscode 'eamodio.gitlens'
  vscode 'editorconfig.editorconfig'
  vscode 'esbenp.prettier-vscode'
  vscode 'genuitecllc.codetogether'
  vscode 'hashicorp.terraform'
  vscode 'hbenl.vscode-test-explorer'
  vscode 'ibm.output-colorizer'
  # vscode 'kevinrose.vsc-python-indent'
  vscode 'mechatroner.rainbow-csv'
  # vscode 'meezilla.json'
  vscode 'mikestead.dotenv'
  vscode 'mkhl.direnv'
  vscode 'ms-azuretools.vscode-docker'
  # vscode 'ms-dotnettools.csdevkit'
  # vscode 'ms-dotnettools.csharp'
  vscode 'ms-dotnettools.vscode-dotnet-runtime'
  # vscode 'ms-ossdata.vscode-postgresql'
  vscode 'ms-python.debugpy'
  vscode 'ms-python.python'
  # vscode 'ms-python.vscode-pylance'
  vscode 'ms-vscode.makefile-tools'
  vscode 'ms-vscode.test-adapter-converter'
  vscode 'ms-vscode.vscode-typescript-next'
  vscode 'oderwat.indent-rainbow'
  vscode 'orta.vscode-jest'
  vscode 'postman.postman-for-vscode'
  vscode 'qwtel.sqlite-viewer'
  vscode 'rangav.vscode-thunder-client'
  vscode 'redhat.vscode-xml'
  vscode 'redhat.vscode-yaml'
  vscode 'richie5um2.vscode-sort-json'
  vscode 'tchayen.markdown-links'
  vscode 'tyriar.sort-lines'
  vscode 'vscode-icons-team.vscode-icons'
  vscode 'vscodevim.vim'
  vscode 'wayou.vscode-todo-highlight'
  vscode 'wholroyd.jinja'
  vscode 'wmaurer.change-case'
  # vscode 'yuvraj.json-scape-unscape'
  vscode 'yzhang.markdown-all-in-one'
  vscode 'ziyasal.vscode-open-in-github'
end

# ----------------------------------------------------------------------------------------------------------
# TODO: This doesn't solve the issue about performing a custom action when a specific formula/cask is (re)installed - keeping for future reference
at_exit do
  # This is required for completions from other plugins to work (for eg git-extras)
  system("rm -rfv \"${HOMEBREW_REPOSITORY}/share/zsh/site-functions/_git\"") || true
end
